Public Attributes | List of all members
API_ElementQuantityMask Struct Reference
Element Manager API
Describes the filter for the different calculated values for elements. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_WallQuantity  | wall
Describes the mask of different calculated values for wall. API_WallQuantity.
API_ColumnQuantity  | column
Describes the mask of different calculated values for column. API_ColumnQuantity.
API_BeamQuantity  | beam
Describes the mask of different calculated values for beam. API_BeamQuantity.
API_DoorQuantity  | door
Describes the mask of different calculated values for door. API_DoorQuantity.
API_WindowQuantity  | window
Describes the mask of different calculated values for window. API_WindowQuantity.
API_SkylightQuantity  | skylight
Describes the mask of different calculated values for skylight. API_SkylightQuantity.
API_ObjectQuantity  | symb
Describes the mask of different calculated values for symb. API_ObjectQuantity.
API_LightQuantity  | light
Describes the mask of different calculated values for light. API_LightQuantity.
API_SlabQuantity  | slab
Describes the mask of different calculated values for slab. API_SlabQuantity.
API_MeshQuantity  | mesh
Describes the mask of different calculated values for mesh. API_MeshQuantity.
API_RoofQuantity  | roof
Describes the mask of different calculated values for roof. API_RoofQuantity.
API_ShellQuantity  | shell
Describes the mask of different calculated values for shell. API_ShellQuantity.
API_MorphQuantity  | morph
Describes the mask of different calculated values for morph. API_MorphQuantity.
API_HatchQuantity  | hatch
Describes the mask of different calculated values for hatch. API_HatchQuantity.
API_ZoneAllQuantity  | zone
Describes the mask of different calculated values for zone. API_ZoneAllQuantity.
API_CurtainWallQuantity  | cw
Describes the mask of different calculated values for curtain wall. API_CurtainWallQuantity.
API_CWFrameQuantity  | cwFrame
Describes the mask of different calculated values for frame of curtain wall. API_CWFrameQuantity.
API_CWPanelQuantity  | cwPanel
Describes the mask of different calculated values for panel of curtain wall. API_CWPanelQuantity.
API_CWJunctionQuantity  | cwJunction
Describes the mask of different calculated values for junction of curtain wall. API_CWJunctionQuantity.
API_CWAccessoryQuantity  | cwAccessory
Describes the mask of different calculated values for accessory of curtain wall. API_CWAccessoryQuantity.
API_StairQuantity  | stair
Describes the different calculated values for stair s.
API_StairRiserQuantity  | stairRiser
Describes the different calculated values for stair risers.
API_StairTreadQuantity  | stairTread
Describes the different calculated values for stair treads.
API_StairStructureQuantity  | stairStructure
Describes the different calculated values for stair structures.
API_RailingQuantity  | railing
Describes the different calculated values for railings.
API_RailingToprailQuantity  | railingToprail
Describes the different calculated values for railing toprails.
API_RailingHandrailQuantity  | railingHandrail
Describes the different calculated values for railing handrails.
API_RailingRailQuantity  | railingRail
Describes the different calculated values for railing rails.
API_RailingToprailEndQuantity  | railingToprailEnd
Describes the different calculated values for railing toprail ends.
API_RailingHandrailEndQuantity  | railingHandrailEnd
Describes the different calculated values for railing handrail ends.
API_RailingRailEndQuantity  | railingRailEnd
Describes the different calculated values for railing rail ends.
API_RailingToprailConnectionQuantity  | railingToprailConnection
Describes the different calculated values for railing toprail connections.
API_RailingHandrailConnectionQuantity  | railingHandrailConnection
Describes the different calculated values for railing handrail connections.
API_RailingRailConnectionQuantity  | railingRailConnection
Describes the different calculated values for railing rail connections.
API_RailingPostQuantity  | railingPost
Describes the different calculated values for railing posts.
API_RailingInnerPostQuantity  | railingInnerPost
Describes the different calculated values for railing inner posts.
API_RailingBalusterQuantity  | railingBaluster
Describes the different calculated values for railing balusters.
API_RailingPanelQuantity  | railingPanel
Describes the different calculated values for railing panels.
API_RailingSegmentQuantity  | railingSegment
Describes the different calculated values for railing segments.
API_ColumnSegmentQuantity  | columnSegment
Describes the different calculated values for column segments. API_ColumnSegmentQuantity.
API_BeamSegmentQuantity  | beamSegment
Describes the different calculated values for beam segments. API_BeamSegmentQuantity.
Detailed Description
Describes the filter for the different calculated values for elements.
Member Data Documentation
◆ beam
 API_ElementQuantityMask::beam
Describes the mask of different calculated values for beam. API_BeamQuantity.
◆ beamSegment
 API_ElementQuantityMask::beamSegment
Describes the different calculated values for beam segments. API_BeamSegmentQuantity.
◆ column
 API_ElementQuantityMask::column
Describes the mask of different calculated values for column. API_ColumnQuantity.
◆ columnSegment
 API_ElementQuantityMask::columnSegment
Describes the different calculated values for column segments. API_ColumnSegmentQuantity.
◆ cw
 API_ElementQuantityMask::cw
Describes the mask of different calculated values for curtain wall. API_CurtainWallQuantity.
◆ cwAccessory
 API_ElementQuantityMask::cwAccessory
Describes the mask of different calculated values for accessory of curtain wall. API_CWAccessoryQuantity.
◆ cwFrame
 API_ElementQuantityMask::cwFrame
Describes the mask of different calculated values for frame of curtain wall. API_CWFrameQuantity.
◆ cwJunction
 API_ElementQuantityMask::cwJunction
Describes the mask of different calculated values for junction of curtain wall. API_CWJunctionQuantity.
◆ cwPanel
 API_ElementQuantityMask::cwPanel
Describes the mask of different calculated values for panel of curtain wall. API_CWPanelQuantity.
◆ door
 API_ElementQuantityMask::door
Describes the mask of different calculated values for door. API_DoorQuantity.
◆ hatch
 API_ElementQuantityMask::hatch
Describes the mask of different calculated values for hatch. API_HatchQuantity.
◆ light
 API_ElementQuantityMask::light
Describes the mask of different calculated values for light. API_LightQuantity.
◆ mesh
 API_ElementQuantityMask::mesh
Describes the mask of different calculated values for mesh. API_MeshQuantity.
◆ morph
 API_ElementQuantityMask::morph
Describes the mask of different calculated values for morph. API_MorphQuantity.
◆ railing
 API_ElementQuantityMask::railing
Describes the different calculated values for railings.
◆ railingBaluster
 API_ElementQuantityMask::railingBaluster
Describes the different calculated values for railing balusters.
◆ railingHandrail
 API_ElementQuantityMask::railingHandrail
Describes the different calculated values for railing handrails.
◆ railingHandrailConnection
 API_ElementQuantityMask::railingHandrailConnection
Describes the different calculated values for railing handrail connections.
◆ railingHandrailEnd
 API_ElementQuantityMask::railingHandrailEnd
Describes the different calculated values for railing handrail ends.
◆ railingInnerPost
 API_ElementQuantityMask::railingInnerPost
Describes the different calculated values for railing inner posts.
◆ railingPanel
 API_ElementQuantityMask::railingPanel
Describes the different calculated values for railing panels.
◆ railingPost
 API_ElementQuantityMask::railingPost
Describes the different calculated values for railing posts.
◆ railingRail
 API_ElementQuantityMask::railingRail
Describes the different calculated values for railing rails.
◆ railingRailConnection
 API_ElementQuantityMask::railingRailConnection
Describes the different calculated values for railing rail connections.
◆ railingRailEnd
 API_ElementQuantityMask::railingRailEnd
Describes the different calculated values for railing rail ends.
◆ railingSegment
 API_ElementQuantityMask::railingSegment
Describes the different calculated values for railing segments.
◆ railingToprail
 API_ElementQuantityMask::railingToprail
Describes the different calculated values for railing toprails.
◆ railingToprailConnection
 API_ElementQuantityMask::railingToprailConnection
Describes the different calculated values for railing toprail connections.
◆ railingToprailEnd
 API_ElementQuantityMask::railingToprailEnd
Describes the different calculated values for railing toprail ends.
◆ roof
 API_ElementQuantityMask::roof
Describes the mask of different calculated values for roof. API_RoofQuantity.
◆ shell
 API_ElementQuantityMask::shell
Describes the mask of different calculated values for shell. API_ShellQuantity.
◆ skylight
 API_ElementQuantityMask::skylight
Describes the mask of different calculated values for skylight. API_SkylightQuantity.
◆ slab
 API_ElementQuantityMask::slab
Describes the mask of different calculated values for slab. API_SlabQuantity.
◆ stair
 API_ElementQuantityMask::stair
Describes the different calculated values for stair s.
◆ stairRiser
 API_ElementQuantityMask::stairRiser
Describes the different calculated values for stair risers.
◆ stairStructure
 API_ElementQuantityMask::stairStructure
Describes the different calculated values for stair structures.
◆ stairTread
 API_ElementQuantityMask::stairTread
Describes the different calculated values for stair treads.
◆ symb
 API_ElementQuantityMask::symb
Describes the mask of different calculated values for symb. API_ObjectQuantity.
◆ wall
 API_ElementQuantityMask::wall
Describes the mask of different calculated values for wall. API_WallQuantity.
◆ window
 API_ElementQuantityMask::window
Describes the mask of different calculated values for window. API_WindowQuantity.
◆ zone
 API_ElementQuantityMask::zone
Describes the mask of different calculated values for zone. API_ZoneAllQuantity.